#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.secret.random_password.password: Refreshing state... [id=none]
github_repository_environment.this: Refreshing state... [id=indok-api:indok-web-production]
data.azurerm_client_config.current: Reading...
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hZTkyMzIxOC03NzQ1LTQ2MmEtOGE4Zi05YzM2N2RmMDExNTk7b2JqZWN0SWQ9YjQ0OWExZjMtMzI4ZC00NTQ4LThhYjEtNmUxZGMwNDhlZGZmO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
github_actions_environment_variable.azure_subscription_id: Refreshing state... [id=indok-api:indok-web-production:AZURE_SUBSCRIPTION_ID]
module.managed_identity.azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production/providers/Microsoft.ManagedIdentity/userAssignedIdentities/indok-web-production]
module.container_app.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production/providers/Microsoft.OperationalInsights/workspaces/indok-web-production]
github_actions_environment_variable.azure_tenant_id: Refreshing state... [id=indok-api:indok-web-production:AZURE_TENANT_ID]
github_actions_environment_variable.azure_client_id: Refreshing state... [id=indok-api:indok-web-production:AZURE_CLIENT_ID]
azurerm_role_assignment.service_principal: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production/providers/Microsoft.Authorization/roleAssignments/d288aae0-a5a5-c825-2480-241c37860060]
module.key_vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production/providers/Microsoft.KeyVault/vaults/indok-web-production]
module.container_app.azurerm_container_app_environment.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production/providers/Microsoft.App/managedEnvironments/indok-web-production]
module.secret.azurerm_key_vault_secret.postgres_password: Refreshing state... [id=https://indok-web-production.vault.azure.net/secrets/postgres-password/3813bd8f294949e1a616f22974d5c3b2]
module.container_app.azurerm_container_app.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production/providers/Microsoft.App/containerApps/indok-web-production]
module.database.azurerm_postgresql_server.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production/providers/Microsoft.DBforPostgreSQL/servers/indok-web-production]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.redis.azurerm_redis_cache.this will be created
  + resource "azurerm_redis_cache" "this" {
      + capacity                      = 0
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + minimum_tls_version           = "1.2"
      + name                          = "indok-web-production"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "indok-web-production"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "environment" = "production"
          + "workspace"   = "production"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @larwaa, Action: `pull_request`*